app/controllers/articles_controller.rb

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2016-07-26 14:42:34.900848"], ["id", 1]]
---
 def show
 	@article.update_visits_count

INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Last??"], ["body", "fsdfoksdkgsddsdfsdfsdfsdfsdfsdf"], ["user_id", 1], ["created_at", "2016-07-12 15:00:06.245499"], ["updated_at", "2016-07-12 15:00:06.245499"]]
---
 def create
 	@article = current_user.articles.new( title:params[:article][:title],
 	body:params[:article][:body])
 	if @article.save then