app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 1], ["body", "primero\r\n\r\n"], ["created_at", "2016-07-26 15:51:50.117327"], ["updated_at", "2016-07-26 15:51:50.117327"]]

    def set_article
      @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]